// Строчные комментарии command+/

/*
   Многострочные комментарии  shift+command+/
*/

/**
 * JSDoc комментарии, важны при написании документации к проектам 3
 * */

// = - оператор присвоения,
//Операторы сравнения
// == - не строгое равно оператор сравнения по значению сравнивает на равенство
//  ===  и строгое условие соблюдно при равенстве значении и типа сравнивает на идентичность


/*
function f1(){
    let i = 1;
    do {
    console.log(i)
    i++
}
    while(3 >= i)
}
 f1()*/
/*
function f2(){
// for (старт; условие при котором цикл выполняется; шаг)
 for (let k = 1; 3 >= k; k++){// с заданным колличеством повторений
     console.log(k);
 } // тело цикла
}
f2()
*/
/*Function Expression
let f3 = function(){// задаём Имя = function(){тело}
  let p = 1;
  while (p <= 3){console.log(p); p++;}
}
f3()*/

//}=> arrow functions

